## Exploratory Data Analysis
# Set up an Data Loading
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np


sns.set_style("whitegrid")

# loading the student performance dataset
df = pd.read_csv("C:\\Users\\A plus\\Desktop\\1.B.tech\\5th Semester\\Data Science\\DS AI ML\\student_performance.csv")

df.head()
# head prints the first five row of dataset

In [22]:
df.info()
# info() provides the basic information datatypes, noo null count, no of entries, list of columns etc
# dtype are 5 object type ie string and 3 integer

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       20 non-null     object
 1   race/ethnicity               20 non-null     object
 2   parental_level_of_education  20 non-null     object
 3   lunch                        20 non-null     object
 4   test_preparation_course      20 non-null     object
 5   math_score                   20 non-null     int64
 6   reading_score                20 non-null     int64
 7   writing_score                20 non-null     int64
dtypes: int64(3), object(5)
memory usage: 1.4+ KB

In [26]:
df.describe()
# desciribe() provide descriptive statistics of the data or summarize statistics
# or tells how does data looks mathematically

       math_score  reading_score  writing_score
count   20.000000      20.000000      20.000000
mean    62.950000      68.750000      66.150000
std     18.952781      17.283625      18.505405
min     18.000000      32.000000      28.000000
25%     49.250000      56.250000      51.500000
50%     69.000000      72.000000      70.000000
75%     73.000000      79.250000      78.000000
max     90.000000      95.000000      93.000000

In [19]:
df.shape
# this gives the no. of rows and column

(20, 8)

In [20]:
df.sample(5)
# this will give random rows from the data set if we do head it only shows top 5 that may be biased initially
# So to balance we use sample method

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
7,male,group B,some college,free/reduced,none,40,43,39
15,male,group C,associate's degree,free/reduced,none,69,75,78
10,male,group C,associate's degree,standard,none,58,54,52
5,female,group B,associate's degree,standard,none,71,83,78
14,female,group A,master's degree,standard,none,50,53,58

In [25]:
df.isnull().sum()
# this will count the missing value in the column but for our data there is no missing values

gender                         0
race/ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

In [32]:
df.duplicated().sum()
# this will show the duplicate rows

np.int64(0)

In [31]:
# df.corr()
# how is the correlation between columns

In [ ]:
# step 2 Univariate Analysis (Individuak Variables)